In [ ]:
#######################
# Ocultar informaci√≥n #
#######################

In [7]:
import pandas as pd
import numpy as np

In [8]:
data = pd.DataFrame({
    'nombre': ['Ana', 'Juan', 'Luis', 'Pedro', 'Silvina'],
    'email': ['ana@ejemplo.com', 'juan@ejemplo.com', 'luis@ejemplo.com', 'pedro@ejemplo.com', 'silvina@ejemplo.com'],
    'edad': [22, 37, 15, 49, 63],
    'ubicacion': ['Ciudad A', 'Ciudad B', 'Ciudad C', 'Ciudad D', 'Ciudad E'],
    'salario': [55000, 34000, 76000, 51000, 62000],
    'banco': ['Banco 1', 'Banco 3', 'Banco 1', 'Banco 2', 'Banco 3']
})

data

    nombre                email  edad ubicacion  salario    banco
0      Ana      ana@ejemplo.com    22  Ciudad A    55000  Banco 1
1     Juan     juan@ejemplo.com    37  Ciudad B    34000  Banco 3
2     Luis     luis@ejemplo.com    15  Ciudad C    76000  Banco 1
3    Pedro    pedro@ejemplo.com    49  Ciudad D    51000  Banco 2
4  Silvina  silvina@ejemplo.com    63  Ciudad E    62000  Banco 3

In [9]:
data.drop(["nombre","email"], axis=1, inplace=True)

In [10]:
data

   edad ubicacion  salario    banco
0    22  Ciudad A    55000  Banco 1
1    37  Ciudad B    34000  Banco 3
2    15  Ciudad C    76000  Banco 1
3    49  Ciudad D    51000  Banco 2
4    63  Ciudad E    62000  Banco 3

In [11]:
data["edad"] = (data["edad"]//10 )*10

In [12]:
data

   edad ubicacion  salario    banco
0    20  Ciudad A    55000  Banco 1
1    30  Ciudad B    34000  Banco 3
2    10  Ciudad C    76000  Banco 1
3    40  Ciudad D    51000  Banco 2
4    60  Ciudad E    62000  Banco 3

In [13]:
ruido = np.random.normal(0, 100, size=data["salario"].shape)
ruido

array([ 9.86713425e+01, -7.89552119e+00, -1.04463882e+02,  7.07884714e-02,
        9.88623584e+01])

In [14]:
data["salario"]+= ruido
data

   edad ubicacion       salario    banco
0    20  Ciudad A  55098.671343  Banco 1
1    30  Ciudad B  33992.104479  Banco 3
2    10  Ciudad C  75895.536118  Banco 1
3    40  Ciudad D  51000.070788  Banco 2
4    60  Ciudad E  62098.862358  Banco 3

In [15]:
data["banco"] = np.random.permutation(data["banco"])

In [16]:
data

   edad ubicacion       salario    banco
0    20  Ciudad A  55098.671343  Banco 3
1    30  Ciudad B  33992.104479  Banco 1
2    10  Ciudad C  75895.536118  Banco 3
3    40  Ciudad D  51000.070788  Banco 1
4    60  Ciudad E  62098.862358  Banco 2

In [17]:
import pandas as pd
import uuid

In [18]:
data = pd.DataFrame({
    'nombre': ['Ana', 'Juan', 'Luis'],
    'email': ['ana@example.com', 'juan@example.com', 'luis@example.com'],
    'ubicacion': ['Ciudad A', 'Ciudad B', 'Ciudad C']
})

data

  nombre             email ubicacion
0    Ana   ana@example.com  Ciudad A
1   Juan  juan@example.com  Ciudad B
2   Luis  luis@example.com  Ciudad C

In [19]:
id_pseudo=[]

In [20]:
for n in range(len(data)):
    id_pseudo.append(str(uuid.uuid4()))

In [21]:
id_pseudo

['1648a06d-bbb9-417d-afeb-7066e5728a47',
 '0d195512-1f79-4432-ade5-2620b4aa2af1',
 'a3cae798-52b7-4df2-b6ec-732f9666b4d1']

In [22]:
data["id_pseudo"] = id_pseudo
data.drop("nombre", axis=1, inplace=True)

In [23]:
data

              email ubicacion                             id_pseudo
0   ana@example.com  Ciudad A  1648a06d-bbb9-417d-afeb-7066e5728a47
1  juan@example.com  Ciudad B  0d195512-1f79-4432-ade5-2620b4aa2af1
2  luis@example.com  Ciudad C  a3cae798-52b7-4df2-b6ec-732f9666b4d1

In [24]:
import hashlib

In [25]:
def hash_data(data):
    return hashlib.sha256(data.encode()).hexdigest()

In [26]:
hash_emails = []

In [27]:
for email in data["email"]:
    h_email= hash_data(email)
    hash_emails.append(h_email)

data["email"] = hash_emails
data

,email,ubicacion,id_pseudo
0,8e43ca37701228e74983efdbd0cff5c16b3b1e5d4e29a7...,Ciudad A,1648a06d-bbb9-417d-afeb-7066e5728a47
1,81b562a0fe2aecc8831e2d7c9942f319736afc2a99415e...,Ciudad B,0d195512-1f79-4432-ade5-2620b4aa2af1
2,861d62c5b964e71b42e61aeb4e876f86908a86300b15b2...,Ciudad C,a3cae798-52b7-4df2-b6ec-732f9666b4d1

In [53]:
mis_tokens={}

In [54]:
def tokenizar(dato):
    token = str(uuid.uuid4())
    mis_tokens[token]=dato
    return token

In [55]:
def recuperar_datos(token):
    return mis_tokens.get(token, "Token no valido")

In [56]:
dato_original = "123-456-789"
token = tokenizar(dato_original)

In [57]:
print(f"Token generado: {token}")
print(f"Dato recuperado: {recuperar_datos(token)}")

Token generado: 4335bb0c-0912-429c-a317-a2b0775bfe53
Dato recuperado: 123-456-789

In [ ]:
##############################
# Eliminar y detectar sesgos #
##############################

In [59]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.utils import resample

In [60]:
data = pd.DataFrame({
    "edad":[22,45,36,29,58],
    "genero":["F", "M", "M", "F", "M"],
    "contratado": [1,0,1,0,1]
})
data

   edad genero  contratado
0    22      F           1
1    45      M           0
2    36      M           1
3    29      F           0
4    58      M           1

In [61]:
agrupado = data.groupby("genero")

In [62]:
for nombre, grupo in agrupado:
    print(nombre, grupo)

F    edad genero  contratado
0    22      F           1
3    29      F           0
M    edad genero  contratado
1    45      M           0
2    36      M           1
4    58      M           1

In [63]:
data_balanceada = pd.DataFrame()

In [67]:
for nombre, grupo in agrupado:
    grupo_balanceado = resample(
        grupo,
        replace=True,
        n_samples=10,
        random_state=123
    )
    data_balanceada = pd.concat([data_balanceada, grupo_balanceado])

In [68]:
data_balanceada

   edad genero  contratado
0    22      F           1
3    29      F           0
0    22      F           1
0    22      F           1
0    22      F           1
0    22      F           1
0    22      F           1
3    29      F           0
3    29      F           0
0    22      F           1
4    58      M           1
2    36      M           1
4    58      M           1
4    58      M           1
1    45      M           0
4    58      M           1
4    58      M           1
2    36      M           1
4    58      M           1
2    36      M           1

In [ ]:
######################################################
# Desarrollo de modelos responsables en Data Science #
######################################################